content/posts/nextcloud_to_do_automation/index.org
#+TITLE: Simple Nextcloud To-Do List Automation with Python and WebDAV
#+DATE: 2019-05-05
#+CATEGORIES[]: Programming
#+TAGS[]: Nextcloud planning
#+ALIASES[]: /nextcloud_to_do_automation

I keep a task list in a [[http://todotxt.org/][todo.txt]] format in
[[https://nextcloud.com/][Nextcloud]]. They are simply kept as two text
files, =todo.txt= and =done.txt= in the root of my Nextcloud user
directory.

Some clients already have the option to move tasks from =todo.txt= to
=done.txt= when you mark a task as done. However, I would prefer they
stick around in the =todo.txt= for a while, in case I change my mind.

At first I thought I'd just write a script to run as a cronjob on the
server hosting Nextcloud, but that won't work with syncrhonization, as
it won't let Nextcloud know the files have changed. I then thought there
must be an API to read/write files to Nextcloud, and then quickly
realized that this API is
[[https://tools.ietf.org/html/rfc2518][WebDAV]]. So, I should be able to
make a Python script to do this, using
[[https://pypi.org/project/requests/][requests]]. A more full-featured
WebDAV library would be overkill for this.

# more

* Outline
Here's what the script will do.

1. Get the =todo.txt= file.
2. If there are any completed tasks in there, get the =done.txt= file.
3. Strip the completed tasks from =todo.txt=.
4. Append the completed tasks to the content from =done.txt=.
5. Update =todo.txt=.
6. If there was no problem updating =todo.txt=, update =done.txt=. This
   step has to be retried in case of a conflict, because now the only
   copy of those done tasks is in the script's memory.

This still leaves room for some issues if the script crashes in the
middle of running, but I figured if it happens I'd get a mail from cron,
and there's a file history in Nextcloud so I can sort it out then. After
running this a few months now it still hasn't happened.

