posts/nextcloud_to_do_automation/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" href="https://elektrubadur.se/style.min.css">
<link href="https://elektrubadur.se/favicon.ico" rel="icon">
<link href="https://elektrubadur.se/favicon-16x16.png" rel="icon" sizes="16x16">
<link href="https://elektrubadur.se/favicon-32x32.png" rel="icon" sizes="32x32">
<link href="https://elektrubadur.se/favicon-96x96.png" rel="icon" sizes="96x96">
<link href="https://elektrubadur.se/favicon-192x192.png" rel="icon" sizes="192x192">
<title>Simple Nextcloud To-Do List Automation with Python and WebDAV – Elektrubadur</title>
<link rel="alternate" type="application/rss+xml" href="https://elektrubadur.se/rss.xml" title="Elektrubadur">
<link rel="sitemap" type="application/xml" title="Elektrubadur Sitemap" href="https://elektrubadur.se/sitemap.xml">
<link rel="me" href="https://social.sdfeu.org/@bkhl">
<meta name="fediverse:creator" content="@bkhl@social.sdfeu.org">
<meta name="description" content="Personal web page of Björn Lindström">
<meta name="author" content="Björn Lindström">
</head>
<body>
<header>
<h2><a href="https://elektrubadur.se/">Elektrubadur</a></h2>
<p><em>Personal web page of Björn Lindström</em></p>
</header>
<main>
<article>
<header>
<h1>Simple Nextcloud To-Do List Automation with Python and WebDAV</h1>
<p>By <em>Björn Lindström</em> in <a href="https://elektrubadur.se/categories/programming/">Programming</a> about <a href="https://elektrubadur.se/tags/nextcloud/">Nextcloud</a> and <a href="https://elektrubadur.se/tags/planning/">Planning</a> —&nbsp;<time datetime="2019-05-05">Sunday&nbsp;May&nbsp;5,&nbsp;2019</time></p>
</header>
<p>I keep a task list in a <a href="http://todotxt.org/">todo.txt</a> format in <a href="https://nextcloud.com/">Nextcloud</a>. They are simply kept as two text files, <code class="verbatim">todo.txt</code> and <code class="verbatim">done.txt</code> in the root of my Nextcloud user directory.</p>
<p>Some clients already have the option to move tasks from <code class="verbatim">todo.txt</code> to <code class="verbatim">done.txt</code> when you mark a task as done. However, I would prefer they stick around in the <code class="verbatim">todo.txt</code> for a while, in case I change my mind.</p>
<p>At first I thought I'd just write a script to run as a cronjob on the server hosting Nextcloud, but that won't work with syncrhonization, as it won't let Nextcloud know the files have changed. I then thought there must be an API to read/write files to Nextcloud, and then quickly realized that this API is <a href="https://tools.ietf.org/html/rfc2518">WebDAV</a>. So, I should be able to make a Python script to do this, using <a href="https://pypi.org/project/requests/">requests</a>. A more full-featured WebDAV library would be overkill for this.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">Outline</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>Here's what the script will do.</p>
<ol>
<li>Get the <code class="verbatim">todo.txt</code> file.</li>
<li>If there are any completed tasks in there, get the <code class="verbatim">done.txt</code> file.</li>
<li>Strip the completed tasks from <code class="verbatim">todo.txt</code>.</li>
<li>Append the completed tasks to the content from <code class="verbatim">done.txt</code>.</li>
<li>Update <code class="verbatim">todo.txt</code>.</li>
<li>If there was no problem updating <code class="verbatim">todo.txt</code>, update <code class="verbatim">done.txt</code>. This step has to be retried in case of a conflict, because now the only copy of those done tasks is in the script's memory.</li>
</ol>
<p>This still leaves room for some issues if the script crashes in the middle of running, but I figured if it happens I'd get a mail from cron, and there's a file history in Nextcloud so I can sort it out then. After running this a few months now it still hasn't happened.</p>
</div>
</div>
